%圆的走向的主程序
clear                                  %清除变量
syms a                                 %定义符号变量
x=cos(a);                              %符号横坐标
y=sin(a);                              %符号纵坐标
tit='逆时针';                          %主要标题
P0_15_2fun(x,y,tit)                    %调用函数文件画起点在正x轴逆时针环绕的圆
P0_15_2fun(x,-y,'顺时针')              %调用函数文件画起点在正x轴顺时针环绕的圆
P0_15_2fun(-x,y,'顺时针')              %调用函数文件画起点在负x轴顺时针环绕的圆
P0_15_2fun(-x,-y,tit)                  %调用函数文件画起点在负x轴逆时针环绕的圆
P0_15_2fun(y,x,'顺时针')               %调用函数文件画起点在正y轴顺时针环绕的圆
P0_15_2fun(-y,x,tit)                   %调用函数文件画起点在正y轴逆时针环绕的圆
P0_15_2fun(y,-x,tit)                   %调用函数文件画起点在负y轴逆时针环绕的圆
P0_15_2fun(-y,-x,'顺时针')             %调用函数文件画起点在负y轴顺时针环绕的圆

%程序结束.周群益设计
