%坐标系的建立
clear                                  %清除变量
figure                                 %创建图形窗口
plot(0,0,'o',[-2,2],[0,0],2,0,'>')     %画原点和水平线以及向右的箭头
hold on                                %保持属性
plot([0,0],[-1,3],0,3,'^')             %画竖直线和向上的箭头
x=-1.5:0.1:1.5;                        %抛物线的横坐标向量
y=x.^2;                                %纵坐标向量
plot(x,y,'LineWidth',2)                %画抛物线
x1=-1.8:0.2:1.8;                       %横轴的横坐标向量
y1=ones(size(x1));                     %全1向量
plot(x1,0*y1,'.')                      %在横轴上画点
X1=[x1;x1];                            %短线的横坐标矩阵
Y1=[0*y1;0.1*y1];                      %纵坐标矩阵
plot(X1,Y1,'r')                        %画短竖线
text(x1-0.1,y1*0-0.1,num2str(x1'))     %标记短竖线
y2=-0.5:0.5:2.5;                       %纵轴的纵坐标向量
x2=ones(size(y2));                     %全1向量
plot(0*x2,y2,'.')                      %在横轴上画点
X2=[0*x2;-0.1*x2];                     %短线的横坐标矩阵
Y2=[y2;y2];                            %纵坐标矩阵
plot(X2,Y2,'r')                        %画短横线
text(0*x2,y2,num2str(y2'))             %标记短横线
text(2.05,0,'\itx','FontSize',16)      %标记横坐标符号
text(0.05,3,'\ity','FontSize',16)      %标记纵坐标符号
axis off                               %关闭坐标系
title('坐标系和抛物线','FontSize',16)  %加标题

% xlabel('\itx','FontSize',16)           %加横坐标
% ylabel('\ity','FontSize',16)           %加纵坐标
% grid on                                %加网格

%程序结束.周群益设计
