%函数的泰勒展开式的主程序
clear                                  %清除变量
syms x                                 %定义符号变量
y=sin(x);                              %符号函数
a=-180;                                %横坐标下限
b=180;                                 %横坐标上限
ym1=-2;                                %纵坐标下限
ym2=2;                                 %纵坐标上限
tit='正弦';                            %函数名
x0=30;                                 %展开点的度数
P3_14_2fun(y,x0,a,b,ym1,ym2,tit)       %调用函数文件
P3_14_2fun(y,0,a,b,ym1,ym2,tit)        %调用函数文件(麦克劳林展开式)
P3_14_2fun(cos(x),x0,a,b,ym1,ym2,'余弦')%调用函数文件
P3_14_2fun(cos(x),0,a,b,ym1,ym2,'余弦')%调用函数文件(麦克劳林展开式)
P3_14_2fun(tan(x),x0,-90,90,-1,3,'正切')%调用函数文件
P3_14_2fun(tan(x),0,-90,90,-2,2,'正切')%调用函数文件(麦克劳林展开式)
title('正切函数的各级麦克劳林展开式','FontSize',16)%修改标题
P3_14_2fun(cot(x),x0,-90,90,-1,5,'余切')%调用函数文件
P3_14_2fun(cot(x)-1/x,0,-180,180,-2,2,'余切')%调用函数文件(麦克劳林展开式)
title('cot\itx\rm-1/\itx\rm函数的各级麦克劳林展开式','FontSize',16)%修改标题

%程序结束.周群益设计
