%极坐标方程和渐屈线的主程序
clear                                  %清除变量
syms t                                 %定义符号极角
r=t;                                   %极径的符号表达式
thm=3*pi;                              %最大极角
tit='阿基米德螺线';                    %部分标题
P3_20_1fun(thm,r,tit)                  %调用函数文件画阿基米德螺线和渐屈线
P3_20_1fun(2*pi,1+cos(t),'尖点在左的心脏线')%调用函数文件画心脏线和渐屈线
P3_20_1fun(2*pi,1-cos(t),'尖点在右的心脏线')%调用函数文件画心脏线和渐屈线
P3_20_1fun(2*pi,1+sin(t),'尖点在下的心脏线')%调用函数文件画心脏线和渐屈线
P3_20_1fun(2*pi,1-sin(t),'尖点在上的心脏线')%调用函数文件画心脏线和渐屈线

%程序结束.周群益设计
