%函数项数列的极限函数的主程序
clear                                  %清除变量
syms x n                               %定义符号变量
fn=(1+x^n+(x^2/2)^n)^(1/n)             %符号函数
xm=3;                                  %最大横坐标
P2_18_2fun(fn,xm)                      %调用函数文件
xx=2:0.01:xm;                          %自变量向量
plot([0,1,xx],[1,1,xx.^2/2],'k-.','LineWidth',2)%画极限线
P2_18_2fun(x^(n+2)/sqrt(2^(2*n)+x^(2*n)),xm)%调用函数文件
plot(2,2*sqrt(2),'.','MarkerSize',20)  %画点
plot(2,0,'o',2,4,'o')                  %画圈
plot([0,2],[0,0],'k-.',xx,xx.^2,'k-.','LineWidth',2)%画极限线

%程序结束.周群益设计
