%多个有理函数的极限
clear                                  %清除变量
syms x                                 %定义符号变量
fc={(x^3-2*x-1)/(x^5-2*x-1),((1+x)*(1+2*x)*(1+3*x)-1)/x,...
    (x^3-3*x+2)/(x^4-4*x+3),(x^3-2*x^2-4*x+8)/(x^4-8*x^2+16),...
    (x^2-5*x+6)/(x^2-8*x+15),...
    (x-1)*(x-2)*(x-3)*(x-4)*(x-5)/(5*x-1)^5};%符号函数元胞
n=length(fc);                          %元胞个数
for i=1:n                              %按元胞循环
    f=fc{i}                            %取函数
    if i<n                             %如果小于总数
        l=limit(f,x,i-2)               %求符号极限
    else                               %否则
        l=limit(f,x,inf)               %求符号极限
    end                                %结束条件
    l=double(l)                        %化为数值
%    pause
end                                    %结束循环

%程序结束.周群益设计
