%极坐标曲线的面积和周长的主程序
clear                                  %清除变量
syms t                                 %定义符号极角变量
r=3*sin(t)*cos(t)/(sin(t)^3+cos(t)^3); %符号极径
t1=0;                                  %最小参变量
t2=pi/2;                               %最大参变量
tit='迪卡尔叶形线';                    %主要标题
P4_16_1fun(r,t1,t2,tit)                %调用函数文件
% P4_16_1fun(sqrt(1/(sin(t)^4+cos(t)^4)),0,2*pi,'方形线')%调用函数文件
% r=sin(t)*cos(t)^2/(sin(t)^4+cos(t)^4); %符号极径
% P4_16_1fun(r,0,pi,'双叶线')            %调用函数文件
% r=(sin(t)^2-cos(t)^2)/cos(t);          %符号极径
% P4_16_1fun(r,-pi/4,pi/4,'环索线')      %调用函数文件

%程序结束.周群益设计
