%上限是变量的定积分的主程序
clear                                  %清除变量
a=1;                                   %积分下限
b=3;                                   %最大上限
y=sym('t/sqrt(1+t^2)')                 %被积函数的符号表达式
%y=sym('x/sqrt(1+x^2)')                 %被积函数的符号表达式
P4_6_1fun(y,a,b)                       %调用函数文件计算画图形(下限大于0)
P4_6_1fun(y,0,b)                       %调用函数文件计算画图形(下限等于0)
P4_6_1fun(y,-a,b)                      %调用函数文件计算画图形(下限小于0)
P4_6_1fun(y,a,-b)            %调用函数文件计算画图形(下限大于0且大于上限)
P4_6_1fun(y,0,-b)            %调用函数文件计算画图形(下限等于0且大于上限)
P4_6_1fun(y,-a,-b)           %调用函数文件计算画图形(下限等于小且大于上限)

%程序结束.周群益设计
